#字符串的格式化
s1 = 'Python'
s2 = 'C语言'
print("{0:10}!".format(s1))
print("{0:10}!".format(s2))
print("编程语言1:{},编程语言2:{}!".format(s1,s2))
print("编程语言1:{0:\0^8},编程语言2:{1:#>8}!".format(s1,s2))



#千分位
a = 12345678
b = 12345678.12345678
print("a:{:->12,}和b:{:#^20,}".format(a,b))
print("a:{:->12,}和b:{:#^30,}".format(a,b))


#小数部分的精度
print("b:{:#^30,.5f}!".format(b))


#整数类型转换
print("{0:d}的二进制是{0:b},unicode字符是{0:c},\
	八进制是{0:o},小写，大写十六进制{0:x},{0:X}!"\
	.format(425))
print("{0:d}的二进制是{0:b},unicode字符是{0:c},\
	八进制是{0:o},小写，大写十六进制{0:x},{0:X}!"\
	.format(0b11010101))
print("{0:d}的二进制是{0:b},unicode字符是{0:c},\
	八进制是{0:o},小写，大写十六进制{0:x},{0:X}!"\
	.format(0XFFCC))


#浮点数格式转换
print("{0:e},{0:E},{0:f},{0:%}".format(3.14))
print("{0:.2e},{0:.3E},{0:.2f},{0:.1f},{0:.1%},!".format(3.14))

